Workspace/OpenFOAM-plus-OpenFOAM-v1812/tutorials/electromagnetics/mhdFoam/hartmann/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication $(getApplication)
runApplication -s sample  postProcess -func sample

#------------------------------------------------------------------------------
